       IDENTIFICATION DIVISION.
       PROGRAM-ID. KJBM010.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  PROG-MESSAGE     PIC X(20).


       PROCEDURE DIVISION.
           MOVE "HELLO, COBOL" TO PROG-MESSAGE.
           PERFORM DISP-MESSAGE.
           STOP RUN.

       DISP-MESSAGE.
           DISPLAY PROG-MESSAGE.
