       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEMPLATE.
      ******************************************************************
      * システム名    ：研修
      * サブシステム名：
      * プログラム名  ：テンプレート用ソースコード
      * 作成日／作成者：２０２６年２月２２日　山田　太郎
      * 変更日／変更者：
      *       変更内容：
      ******************************************************************

       ENVIRONMENT DIVISION.
      * ファイル変数とファイルとの紐づけ など

       DATA DIVISION.
      * データの定義 など

       PROCEDURE DIVISION.
      ******************************************************************
      * メインルーチン
      ******************************************************************
           PERFORM INIT-RTN.
           PERFORM READ-RTN UNTIL END-FLG = "Y".
           PERFORM NORM-END-RTN.
      ******************************************************************
      * 初期化
      ******************************************************************
       INIT-RTN SECTION.
      * 初期化処理
       EXT.
           EXIT.
      ******************************************************************
      * ファイルから読み込み
      ******************************************************************
       READ-RTN SECTION.
      * ファイルからレコードを読み込む
       EXT.
           EXIT.
      ******************************************************************
      * 〇〇処理
      ******************************************************************
       MAIN-RTN SECTION.
      * 主となる処理
       EXT.
           EXIT.
      ******************************************************************
      * 書き込み処理
      ******************************************************************
       WRITE-RTN SECTION.
      * ファイルへ１レコード出力
       EXT.
           EXIT.
      ******************************************************************
      * 正常終了処理
      ******************************************************************
       NORM-END-RTN SECTION.
      * 正常終了処理
       EXT.
           EXIT.
      ******************************************************************
      * 異常終了処理
      ******************************************************************
       ABORT-RTN SECTION.
      * 異常終了処理
       EXT.
           EXIT.
      ******************************************************************
      * 終了処理
      ******************************************************************
       TERM-RTN SECTION.
      * 共通終了処理
           STOP RUN.
