000010******************************************************************
000020*    KUCF020 : 売上集計ファイル                  LRECL=30
000030******************************************************************
000040     03  UF020-TOKU-COD              PIC  X(04).
000050     03  UF020-JUCHU-DATE.
000060       05  UF020-JUCHU-YY            PIC  9(04).
000070       05  UF020-JUCHU-MM            PIC  9(02).
000080     03  UF020-KINGAKU               PIC S9(09) PACKED-DECIMAL.
000090     03  FILLER                      PIC  X(15).
