000010******************************************************************
000020*    KCCMTOK : ìæà”êÊÉ}ÉXÉ^
000030******************************************************************
000040 01  CMTOK-TOKU-COD                  PIC  X(04).
000050 01  CMTOK-TOKU-MEI                  PIC  X(20).
000060 01  CMTOK-URIKAKE-YM                PIC  X(06).
000070 01  CMTOK-URIKAKE-ZAN               PIC S9(09).
000080 01  CMTOK-URIAGE-GAKU               PIC S9(09).
000090 01  CMTOK-NYUKIN-GAKU               PIC S9(09).
