000010******************************************************************
000020*    KJCF010 : éÛíçÉfÅ[É^                        LRECL=50
000030******************************************************************
000040     03  JF010-DATA-KBN              PIC  X(01).
000050     03  FILLER                      PIC  X(01).
000060     03  JF010-JUCHU-NO-X.
000070       05  JF010-JUCHU-NO            PIC  9(04).
000080     03  FILLER                      PIC  X(01).
000090     03  JF010-JUCHU-DATE.
000100       05  JF010-JUCHU-YY            PIC  9(02).
000110       05  JF010-JUCHU-MM            PIC  9(02).
000120       05  JF010-JUCHU-DD            PIC  9(02).
000130     03  FILLER                      PIC  X(01).
000140     03  JF010-TOKU-COD              PIC  X(04).
000150     03  FILLER                      PIC  X(01).
000160     03  JF010-SHOHIN-NO             PIC  X(05).
000170     03  FILLER                      PIC  X(01).
000180     03  JF010-SURYO-X.
000190       05  JF010-SURYO               PIC  9(05).
000200     03  FILLER                      PIC  X(20).
