      ******************************************************************
      * サンプルCOPYブック
      ******************************************************************
           03  GREETING PIC N(5)  VALUE 'こんにちは'.
           03  YOURNAME PIC X(20) VALUE SPACE.
