       01 CALCYESTERDAY-P1.
         03 DATE-YYYYMMDD            PIC    X(08).
         03 YESTERDAY-YYYYMMDD       PIC    X(08).
         03 ERR                      PIC    X(01).
 