      ******************************************************************
      * システム名    ：サンプル
      * サブシステム名：
      * プログラム名  ：末日を計算するサブプログラムのパラメータ
      * 作成日／作成者：２０２５年１０月２９日  システム技研
      * 変更日／変更者：
      *       変更内容：
      ******************************************************************
       01 CALCYESTERDAY-P1.
         03 DATE-YYYYMMDD            PIC    X(08).
         03 YESTERDAY-YYYYMMDD       PIC    X(08).
         03 ERR                      PIC    X(01).
 