       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST-CALCYESTERDAY.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY  CALCYESTERDAY-PARAMS.


       PROCEDURE DIVISION.
           DISPLAY "*** SYSTEM-DATE ***".

           MOVE  FUNCTION CURRENT-DATE  TO  DATE-YYYYMMDD.
           PERFORM CALL-CALCYESTERDAY.
       
           DISPLAY "*** URUU-DOSHI ***".

           MOVE  "20000301"  TO  DATE-YYYYMMDD.
           PERFORM CALL-CALCYESTERDAY.

           MOVE  "20200301"  TO  DATE-YYYYMMDD.
           PERFORM CALL-CALCYESTERDAY.
       
           MOVE  "21000301"  TO  DATE-YYYYMMDD.
           PERFORM CALL-CALCYESTERDAY.

           MOVE  "20210301"  TO  DATE-YYYYMMDD.
           PERFORM CALL-CALCYESTERDAY.

           STOP RUN.
       
       CALL-CALCYESTERDAY SECTION.
           CALL "CALCYESTERDAY" USING CALCYESTERDAY-P1.
           DISPLAY DATE-YYYYMMDD " -> " YESTERDAY-YYYYMMDD.
           EXIT.
